# CurrentCanvasTheme Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIThemeManager..::..CurrentCanvasTheme Property
UIThemeManager Class See Also
---
current canvas theme.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static UITheme CurrentCanvasTheme { get; set; }
```

Visual Basic
---
```text
Public Shared Property CurrentCanvasTheme As UITheme
	Get
	Set
```

Visual C++
---
```text
public:
static property UITheme CurrentCanvasTheme {
	UITheme get ();
	void set (UITheme value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
UIThemeManager Class
Autodesk.Revit.UI Namespace